Add Hardware requirements
